Revit 2027 API
ParameterTypeId.RoofAttrThicknessParam Property
 "Thickness"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RoofAttrThicknessParam { get; }
Public Shared ReadOnly Property RoofAttrThicknessParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RoofAttrThicknessParam {
	ForgeTypeId^ get ();
}
static member RoofAttrThicknessParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace